-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 23, 2023 at 02:49 PM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 8.1.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `my_chat_app`
--

-- --------------------------------------------------------

--
-- Table structure for table `friends`
--

CREATE TABLE `friends` (
  `ID` int(11) NOT NULL,
  `from_id` int(11) NOT NULL,
  `to_id` int(11) NOT NULL,
  `status` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `friends`
--

INSERT INTO `friends` (`ID`, `from_id`, `to_id`, `status`) VALUES
(1, 1, 2, 1),
(25, 1, 4, 1),
(26, 5, 1, 1),
(27, 3, 1, 1),
(28, 6, 1, 1),
(29, 7, 1, 1),
(30, 7, 2, 1),
(31, 8, 1, 1),
(32, 8, 3, 1),
(33, 10, 1, 1),
(34, 1, 9, 1);

-- --------------------------------------------------------

--
-- Table structure for table `groups`
--

CREATE TABLE `groups` (
  `ID` int(11) NOT NULL,
  `name` text NOT NULL,
  `creator` text NOT NULL,
  `users` text NOT NULL,
  `date` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `groups`
--

INSERT INTO `groups` (`ID`, `name`, `creator`, `users`, `date`) VALUES
(1, 'Yaman', 'ArabPixel', '1,4,3', '2023-02-25 15:34:25');

-- --------------------------------------------------------

--
-- Table structure for table `messages`
--

CREATE TABLE `messages` (
  `ID` int(11) NOT NULL,
  `from_id` int(11) NOT NULL,
  `to_id` int(11) NOT NULL,
  `msg` mediumtext NOT NULL,
  `date` mediumtext NOT NULL,
  `deleted` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `messages`
--

INSERT INTO `messages` (`ID`, `from_id`, `to_id`, `msg`, `date`, `deleted`) VALUES
(1, 2, 1, ',', '2023-02-06 20:42:10', 0),
(2, 1, 2, 'Ey merve was geht\n', '2023-02-06 20:42:10', 0),
(3, 2, 1, 'Ah jetzt', '2023-02-06 20:42:14', 0),
(4, 2, 1, 'Was geht ab Yamannn', '2023-02-06 20:42:21', 0),
(5, 1, 2, 'jo, shau mal mein status wie es offline geht', '2023-02-06 20:42:31', 0),
(6, 1, 2, 'hast du gesehen?', '2023-02-06 20:42:44', 0),
(7, 2, 1, 'Viel besser so als auf WhatsApp ', '2023-02-06 20:42:44', 0),
(8, 2, 1, 'Ja', '2023-02-06 20:42:47', 0),
(9, 1, 2, 'lol, beta version', '2023-02-06 20:42:55', 0),
(10, 2, 1, 'Alpha version 🔥', '2023-02-06 20:43:07', 0),
(11, 1, 2, 'später wir alles besser aussehen und besser funktionieren\n', '2023-02-06 20:43:26', 0),
(12, 2, 1, 'Geiles Projekt ', '2023-02-06 20:43:32', 0),
(13, 2, 1, 'Stabölll', '2023-02-06 20:43:37', 0),
(14, 1, 2, 'inschallah mache ich weiter', '2023-02-06 20:43:46', 0),
(15, 2, 1, 'Was mir krass gefällt ist, dass man bei den Nachrichten sehen kann wann genau sie geschrieben worden sind', '2023-02-06 20:44:02', 0),
(16, 1, 2, 'Joo', '2023-02-06 20:44:17', 0),
(17, 2, 1, 'Das machst du doch mit deinem Freund zusammen oder nicht\n', '2023-02-06 20:44:21', 0),
(18, 1, 2, 'aber bei whatsapp gibt so an jeder tag das blaue text die drauf das Datum steht', '2023-02-06 20:44:42', 0),
(19, 1, 2, 'ja\n', '2023-02-06 20:44:50', 0),
(20, 2, 1, 'Ja aber dann muss man im Chat viel suchen \n', '2023-02-06 20:45:05', 0),
(21, 1, 2, 'das ist nur zum testen ob wir neue sachen schaffen zu programmieren', '2023-02-06 20:45:18', 0),
(22, 2, 1, 'Falls ich eine Nachricht find\nen will', '2023-02-06 20:45:18', 0),
(23, 2, 1, 'Aber ist gut ', '2023-02-06 20:45:28', 0),
(24, 2, 1, '🙏🙏', '2023-02-06 20:45:33', 0),
(25, 1, 2, 'gute idee, Danke', '2023-02-06 20:45:35', 0),
(26, 2, 1, 'Die emojis hier sind auch besser weil samsung \n', '2023-02-06 20:45:49', 0),
(27, 1, 2, 'werde ich drann arbeiten', '2023-02-06 20:45:51', 0),
(28, 2, 1, 'Inshallah\n', '2023-02-06 20:45:57', 0),
(29, 1, 2, 'knopf geht nicht , muss noch weiter programmieren das ist gerade nur ein Icon', '2023-02-06 20:46:19', 0),
(30, 1, 2, 'und soll noch Typing machen zb.\nMerve ist Typing..', '2023-02-06 20:46:42', 0),
(31, 2, 1, 'Ja aber hast doch schon viel geschafft ', '2023-02-06 20:46:44', 0),
(32, 2, 1, 'Zb können wir hier zsm schreiben ', '2023-02-06 20:46:52', 0),
(33, 2, 1, 'Ahhh', '2023-02-06 20:46:57', 0),
(34, 1, 2, 'Schritt vor Schritt geht alles', '2023-02-06 20:47:06', 0),
(35, 2, 1, 'Genau ', '2023-02-06 20:47:11', 0),
(36, 2, 1, 'Kann man hier schon Gruppen erstellen?\n', '2023-02-06 20:47:20', 0),
(37, 1, 2, 'Du bekommst was wenn ich alles fertig bin, early access und tester rollen lol\n', '2023-02-06 20:47:44', 0),
(38, 1, 2, 'noch nicht', '2023-02-06 20:47:50', 0),
(39, 2, 1, 'Okööööö', '2023-02-06 20:47:58', 0),
(40, 2, 1, 'Hade gehe schlafen ', '2023-02-06 20:48:09', 0),
(41, 1, 2, 'photos schicken auch noch nicht', '2023-02-06 20:48:11', 0),
(42, 2, 1, 'Viel Spaß bei deinem Praktikum morgen und gute Nacht ', '2023-02-06 20:48:19', 0),
(43, 2, 1, 'Audios auch noch nicht 🚬', '2023-02-06 20:48:28', 0),
(44, 1, 2, 'Oköö \ndanke sehr merve KING 😊', '2023-02-06 20:48:29', 0),
(45, 2, 1, 'Yaman King 👑', '2023-02-06 20:48:39', 0),
(46, 1, 2, 'jap , hab sie nicht programmiert\nGute nacht Lady', '2023-02-06 20:48:57', 0),
(47, 5, 1, 'السلام عليكم', '2023-02-19 16:08:18', 0),
(48, 1, 5, 'الو', '2023-02-19 16:08:26', 0),
(49, 1, 5, 'تست', '2023-02-19 16:08:40', 0),
(50, 5, 1, 'بلالى', '2023-02-19 16:08:42', 0),
(51, 1, 5, 'hi', '2023-02-19 16:10:41', 0),
(52, 5, 1, 'شلونك\n', '2023-02-19 16:10:48', 0),
(53, 3, 1, '>Hi', '2023-02-19 16:14:03', 0),
(54, 1, 3, 'Wassup', '2023-02-19 16:14:14', 0),
(55, 1, 3, 'asd', '2023-02-19 16:15:18', 0),
(56, 1, 3, 'asdsad', '2023-02-19 16:16:44', 0),
(57, 1, 3, 'asdsd', '2023-02-19 16:17:07', 0),
(58, 1, 3, 'asd', '2023-02-19 16:17:11', 0),
(59, 1, 3, 'asda', '2023-02-19 16:18:19', 0),
(60, 1, 3, 'sad', '2023-02-19 16:19:07', 0),
(61, 3, 1, 'test', '2023-02-19 16:19:34', 0),
(62, 1, 3, 'sd', '2023-02-19 16:20:39', 0),
(63, 1, 3, 'joo', '2023-02-19 16:22:33', 0),
(64, 1, 3, 'Test', '2023-02-19 16:29:28', 0),
(65, 3, 1, 'hello bro', '2023-02-19 16:30:20', 0),
(66, 1, 3, 'hi', '2023-02-19 16:30:27', 0),
(67, 3, 1, 'wassup', '2023-02-19 16:30:32', 0),
(68, 3, 1, 'hii', '2023-02-19 16:32:52', 0),
(69, 3, 1, '343434434', '2023-02-19 16:35:15', 0),
(70, 1, 3, 'xxxxxxxxxxxxx', '2023-02-19 17:20:35', 0),
(71, 1, 4, '<h1>Test</h1>', '2023-02-25 15:15:53', 0),
(72, 1, 4, '<h1>Hlaa</h1>', '2023-02-25 15:19:12', 0),
(73, 1, 4, '<h1>123</h1>', '2023-02-25 15:20:48', 0),
(74, 1, 4, '<h1>yes</h1>', '2023-02-25 15:25:19', 0),
(75, 1, 4, '<h1>it works now</h1>', '2023-02-25 15:27:30', 0),
(76, 1, 4, '<mark>no?</mark>', '2023-02-25 15:27:51', 0),
(77, 6, 1, 'انت قافل', '2023-02-26 10:40:57', 0),
(78, 1, 6, 'انا موجود', '2023-02-26 10:41:16', 0),
(79, 6, 1, 'تمام', '2023-02-26 10:41:56', 0),
(80, 6, 1, 'الله ينور', '2023-02-26 10:41:59', 0),
(81, 1, 6, 'كيف المعلم', '2023-02-26 10:42:06', 0),
(82, 6, 1, 'بس محتاج شغل كتير لسة', '2023-02-26 10:42:10', 0),
(83, 1, 6, 'طبعا هذا لسه ما قبل ال alpha', '2023-02-26 10:42:24', 0),
(84, 6, 1, 'اولا إشارة إعلام صوتي عند وصول الرسائل', '2023-02-26 10:42:35', 0),
(85, 1, 6, 'اذا انت ما كنت بالشات بجيك \nAlert', '2023-02-26 10:42:58', 0),
(86, 6, 1, 'ماجاني', '2023-02-26 10:43:09', 0),
(87, 1, 6, 'html في مشكلة ان اوامر ال بتشتغل\n', '2023-02-26 10:43:21', 0),
(88, 1, 6, 'لازم تكون خارج محادثتي', '2023-02-26 10:43:29', 0),
(89, 1, 6, 'اذا اطلععت وانا راسلتك تجيك', '2023-02-26 10:43:50', 0),
(90, 6, 1, 'بيجي Alert بس مو صوتي', '2023-02-26 10:43:53', 0),
(91, 1, 6, 'يب لسه ما سويتها', '2023-02-26 10:44:08', 0),
(92, 1, 6, 'هو جديد بدائي نصائحك تهمني', '2023-02-26 10:44:21', 0),
(93, 6, 1, 'بتكون عبارة عن رساله مرئية', '2023-02-26 10:44:23', 0),
(94, 1, 6, 'notification قصدك', '2023-02-26 10:44:49', 0),
(95, 6, 1, 'بصراحة جميل التصميم ', '2023-02-26 10:44:57', 0),
(96, 6, 1, 'ايوة ', '2023-02-26 10:45:03', 0),
(97, 1, 6, 'بتجي من فوق على الجوال و من البي سي من اليمين', '2023-02-26 10:45:09', 0),
(98, 1, 6, 'كيف احل مشكلة اوامر html هنا', '2023-02-26 10:45:30', 0),
(99, 6, 1, 'حاول تستخدم برامج تصحيح اخطاء الاكواد', '2023-02-26 10:46:08', 0),
(100, 1, 6, '<h1>h1</h1>', '2023-02-26 10:46:25', 0),
(101, 1, 6, 'هذا مثال\n', '2023-02-26 10:46:29', 0),
(102, 1, 6, '<alert>hacker</alert>', '2023-02-26 11:42:03', 0),
(103, 1, 6, '<h1>الله حيو ظبط</h1>', '2023-02-26 11:42:20', 0),
(104, 1, 5, 'السلام عليكم اخي بالله كيف الحال', '2023-03-04 09:02:04', 0),
(105, 5, 1, 'اهلين حبيبي انت كيفك', '2023-03-04 09:03:14', 0),
(106, 1, 3, 'alright?', '2023-03-05 15:54:46', 0),
(107, 3, 1, 'haha yeah', '2023-03-05 15:54:56', 0),
(108, 1, 3, 'hey man how are you doing=', '2023-03-05 16:01:24', 0),
(109, 3, 1, 'hey, i am very good bro :)', '2023-03-05 16:01:40', 0),
(110, 1, 3, 'hehehe u r leander', '2023-03-05 16:15:57', 0),
(111, 1, 3, 'test1', '2023-03-05 16:42:29', 0),
(112, 1, 3, '213', '2023-03-05 16:42:32', 0),
(113, 1, 3, 'asd\n', '2023-03-05 16:43:53', 0),
(114, 1, 3, 'asdsad', '2023-03-05 16:43:54', 0),
(115, 1, 3, 'test', '2023-03-05 16:44:28', 0),
(116, 1, 3, 'asd', '2023-03-05 16:44:32', 0),
(117, 1, 3, 'sd', '2023-03-05 16:44:37', 0),
(118, 1, 3, 'asdsdasdasd', '2023-03-05 16:44:40', 0),
(119, 1, 3, 'hi', '2023-03-05 20:03:24', 0),
(120, 1, 3, 'wassup', '2023-03-05 20:03:34', 0),
(121, 1, 3, '\ni am yaman', '2023-03-05 20:03:36', 0),
(122, 1, 3, 'testy', '2023-03-05 20:03:57', 0),
(123, 1, 3, 'yaman', '2023-03-05 20:04:10', 0),
(124, 1, 3, 'yaman', '2023-03-05 20:04:40', 0),
(125, 1, 3, 'asadsad', '2023-03-05 20:05:51', 0),
(126, 1, 3, 'salam alikom', '2023-03-05 20:06:27', 0),
(127, 1, 3, 'tamam', '2023-03-05 20:06:32', 0),
(128, 3, 1, 'Hehe', '2023-03-05 20:07:40', 0),
(129, 3, 1, 'What is your problem?', '2023-03-05 20:21:54', 0),
(130, 1, 2, 'bist du online ?', '2023-03-09 16:49:13', 0),
(131, 2, 1, 'Aboowwww', '2023-03-09 16:49:17', 0),
(132, 1, 7, 'was geht?\n', '2023-03-09 16:49:52', 0),
(133, 1, 7, 'Was geht ab taylan', '2023-03-09 16:51:54', 0),
(134, 2, 7, 'Aboww ', '2023-03-09 16:53:38', 0),
(135, 1, 2, 'test', '2023-03-09 16:53:44', 0),
(136, 1, 3, 'was geht', '2023-03-13 18:00:11', 0),
(137, 1, 3, 'ich bin yaman', '2023-03-13 18:00:15', 0),
(138, 3, 1, 'joo geht wieder', '2023-03-13 18:00:24', 0),
(139, 3, 1, 'test', '2023-03-13 18:00:43', 0),
(140, 1, 3, 'hlaa', '2023-03-13 18:00:59', 0),
(141, 3, 1, 'Test', '2023-03-13 18:05:15', 0),
(142, 1, 3, 'yeah it works', '2023-03-13 18:05:20', 0),
(143, 3, 1, 'is this workinng?? yeah its awesome bro just awesome', '2023-03-13 18:07:43', 0),
(144, 1, 8, 'اهلا', '2023-03-13 18:51:26', 0),
(145, 8, 1, 'Hi', '2023-03-13 18:51:39', 0),
(146, 1, 8, 'على الكمبيوتر قمت بعمل ارسال عن طريقة \nEnter ', '2023-03-13 18:51:57', 0),
(147, 8, 1, 'حاول تحذف التاريخ وتخلي التوقيت فقط ب المحادثة', '2023-03-13 18:52:07', 0),
(148, 1, 8, 'و يمكنك رؤية Typing في الأعلى', '2023-03-13 18:52:12', 0),
(149, 8, 1, 'مثل واتس اب', '2023-03-13 18:52:37', 0),
(150, 1, 8, 'بالظبط', '2023-03-13 18:52:44', 0),
(151, 8, 1, 'وتضيف رد على المحادثة', '2023-03-13 18:52:57', 0),
(152, 1, 8, 'هذه ستكون معقدة قليلا', '2023-03-13 18:53:29', 0),
(153, 8, 1, 'ليس لدي خبرة ب node js اما ساعدتك', '2023-03-13 18:53:57', 0),
(154, 8, 1, 'ساتعلم ان شاء الله واساعدك ', '2023-03-13 18:54:14', 0),
(155, 1, 8, 'انت الان اذا فاضي حاول تظبط تصميم لنا', '2023-03-13 18:54:34', 0),
(156, 8, 1, 'نعم', '2023-03-13 18:54:41', 0),
(157, 1, 8, 'وأنا سأحاول بالباك اند', '2023-03-13 18:54:43', 0),
(158, 8, 1, 'سابدأ', '2023-03-13 18:54:43', 0),
(159, 8, 1, 'تمام اتفقنا', '2023-03-13 18:54:53', 0),
(160, 8, 1, 'جميلة امور typing...', '2023-03-13 18:55:08', 0),
(161, 1, 8, 'ادخل على قيت هوب و قوم بعمل  new branche', '2023-03-13 18:55:13', 0),
(162, 1, 8, 'شكرا😁', '2023-03-13 18:55:25', 0),
(163, 1, 8, 'و سميها Frontend', '2023-03-13 18:55:36', 0),
(164, 1, 8, 'Front-end', '2023-03-13 18:55:42', 0),
(165, 1, 8, 'و ستقوم بربطها عندك في محرر الأكواد وترفع عليها الملفات', '2023-03-13 18:56:07', 0),
(166, 8, 1, 'اوكي ', '2023-03-13 18:56:22', 0),
(167, 8, 1, 'سابحث بالامر ', '2023-03-13 18:56:26', 0),
(168, 1, 8, 'حاول كل ما يكون في تحديث كبير ترفعهم على القيت هوب', '2023-03-13 18:56:38', 0),
(169, 1, 8, 'المفروض انا ارفع اكواد باك اند فقط لكن ب الاخير ندمجهم و يطلع لنا المنتج الاخير', '2023-03-13 18:57:07', 0),
(170, 1, 8, 'هل لديك اسغلة؟', '2023-03-13 18:57:30', 0),
(171, 1, 8, 'اساله', '2023-03-13 18:57:35', 0),
(172, 8, 1, 'شو اعمالك الان ؟', '2023-03-13 18:58:17', 0),
(173, 8, 1, 'التطبيق سريع', '2023-03-13 18:58:32', 0),
(174, 1, 8, 'مبزة الرد\nو تحسينات الموقع حاليا', '2023-03-13 18:58:55', 0),
(175, 1, 8, 'ليس كما يجب لازم نخليه اسرع', '2023-03-13 18:59:09', 0),
(176, 8, 1, 'اعلم ', '2023-03-13 18:59:20', 0),
(177, 1, 8, 'يجب عند تشغيل السيرفر سحب جميع المعلومات من قاعدة البينات و تحزينها في ملف حتى يصبح الموقع اسرع', '2023-03-13 18:59:48', 0),
(178, 8, 1, 'وافضل شيئ ', '2023-03-13 19:00:26', 0),
(179, 8, 1, 'تجلب بيانات المستخدم وحدها', '2023-03-13 19:00:44', 0),
(180, 1, 8, 'ما هو؟', '2023-03-13 19:01:29', 0),
(181, 8, 1, 'ولازم تضيف صوت الnotification و الرسائل ', '2023-03-13 19:01:40', 0),
(182, 1, 8, 'اها', '2023-03-13 19:01:40', 0),
(183, 8, 1, 'حتى يكون الملف اخف ', '2023-03-13 19:02:02', 0),
(184, 1, 8, 'سأقوم بكتابتهم', '2023-03-13 19:02:06', 0),
(185, 1, 8, 'المشكلة احتاج الى تصميم حتى اركبهم ', '2023-03-13 19:02:26', 0),
(186, 8, 1, 'انا رح ابدأ اصمم تصميم يكون فريد ', '2023-03-13 19:02:45', 0),
(187, 8, 1, 'النا ', '2023-03-13 19:02:52', 0),
(188, 1, 8, 'تمام', '2023-03-13 19:03:16', 0),
(189, 1, 8, 'انشاء الله نقدر نخلص المشروع و يكون في افضل شكل', '2023-03-13 19:03:31', 0),
(190, 8, 1, 'ان شاء الله ', '2023-03-13 19:03:41', 0),
(191, 8, 1, 'بلش بالتطويرات وانا ببلش بالتصميم', '2023-03-13 19:03:53', 0),
(192, 1, 8, 'و سأقوم بجعل التنقل بين الدردشات اسرع بدون اعادة تحميل للصفحة', '2023-03-13 19:04:12', 0),
(193, 8, 1, 'تمام', '2023-03-13 19:05:21', 0),
(194, 8, 1, 'بالتوفيق', '2023-03-13 19:05:42', 0),
(195, 1, 8, 'شكرا', '2023-03-13 19:07:53', 0),
(196, 1, 3, 'the messages didnt save?', '2023-03-19 10:29:00', 0),
(197, 1, 3, 'test', '2023-03-19 10:29:21', 0),
(198, 1, 3, 'testy', '2023-03-19 10:31:31', 0),
(199, 3, 1, 'yeah', '2023-03-19 10:31:59', 0),
(200, 3, 1, 'why not scrolling`?', '2023-03-19 10:32:07', 0),
(201, 1, 3, 'test bro', '2023-03-19 10:35:01', 0),
(202, 3, 1, 'yeah so its perfect', '2023-03-19 10:35:08', 0),
(203, 3, 1, 'gg', '2023-03-19 10:35:14', 0),
(204, 3, 1, 'i am really happy now', '2023-03-19 10:36:08', 0),
(205, 1, 3, 'me as well bro', '2023-03-19 10:36:19', 0),
(206, 1, 3, 'love this', '2023-03-19 10:36:23', 0),
(207, 1, 3, 'ehehe everything is going well nw', '2023-03-19 10:36:43', 0),
(208, 3, 1, 'why nor scrolling', '2023-03-19 10:36:56', 0),
(209, 3, 1, 'now test', '2023-03-19 10:38:59', 0),
(210, 3, 1, 'good for now', '2023-03-19 10:39:11', 0),
(211, 1, 3, 'yeee its scrolling', '2023-03-19 10:39:23', 0),
(212, 1, 3, 'test', '2023-03-19 10:39:48', 0),
(213, 3, 1, 'Does ist?', '2023-03-19 11:07:16', 0),
(214, 3, 1, 'Yeah it does', '2023-03-19 11:07:59', 0),
(215, 1, 3, 'test', '2023-03-19 11:13:42', 0),
(216, 1, 3, 'does it work?', '2023-03-19 11:14:34', 0),
(217, 1, 3, 'bu tnow?', '2023-03-19 11:14:51', 0),
(218, 1, 3, 'test', '2023-03-19 11:15:31', 0),
(219, 3, 1, 'Test', '2023-03-19 11:15:45', 0),
(220, 3, 1, 'Yeah it works', '2023-03-19 11:15:56', 0),
(221, 1, 3, 'smooth?', '2023-03-19 11:17:28', 0),
(222, 3, 1, 'Yeah', '2023-03-19 11:17:41', 0),
(223, 1, 3, 'test', '2023-03-19 11:25:32', 0),
(224, 1, 3, 'test', '2023-03-19 19:43:50', 0),
(225, 1, 3, 'Here is\n1 \n2', '2023-03-19 19:48:42', 0),
(226, 1, 7, 'HIi', '2023-03-19 21:36:04', 0),
(227, 1, 7, 'why not sending?', '2023-03-19 21:36:17', 0),
(228, 1, 7, 'testy', '2023-03-19 21:37:15', 0),
(229, 3, 8, 'test', '2023-03-19 21:38:31', 0),
(230, 1, 3, 'why?', '2023-03-19 21:38:53', 0),
(231, 3, 1, 'i thought it is not working for some reason', '2023-03-19 21:39:57', 0),
(232, 3, 1, 'lets test', '2023-03-19 21:46:59', 0),
(233, 3, 1, 'finally test', '2023-03-19 21:48:54', 0),
(234, 3, 1, 'yeah it worked', '2023-03-19 21:49:21', 0),
(235, 3, 1, 'test', '2023-03-19 21:50:01', 0),
(236, 3, 1, 'test', '2023-03-19 21:51:53', 0),
(237, 1, 3, 'test', '2023-03-19 21:53:44', 0),
(238, 3, 1, 'Test', '2023-03-22 13:37:57', 0),
(239, 1, 3, 'هلا', '2023-03-22 13:40:21', 0),
(240, 1, 3, 'test', '2023-03-22 13:55:00', 0),
(241, 1, 3, 'not shoiwing?', '2023-03-22 13:55:17', 1),
(242, 1, 3, 'show', '2023-03-22 13:55:55', 1),
(243, 3, 1, 'Let me try', '2023-03-22 13:56:24', 1),
(244, 3, 1, 'Not working', '2023-03-22 13:56:40', 0),
(245, 3, 1, 'Or?', '2023-03-22 13:57:09', 0),
(246, 10, 1, 'Stfu', '2023-03-22 17:25:20', 0),
(247, 1, 10, 'انتي نكبة', '2023-03-22 17:25:46', 1),
(248, 10, 1, 'Du papa fragen wegen laptop', '2023-03-22 17:26:13', 0),
(249, 1, 9, 'Moin madame', '2023-03-23 13:27:22', 0),
(250, 1, 9, 'test', '2023-03-23 13:36:36', 0),
(251, 1, 9, 'get das?', '2023-03-23 13:36:43', 0),
(252, 1, 9, 'ne', '2023-03-23 13:37:02', 0),
(253, 1, 9, 'test', '2023-03-23 13:37:33', 0),
(254, 1, 9, 'jetz aber', '2023-03-23 13:38:25', 0),
(255, 1, 9, 'test', '2023-03-23 13:38:29', 0),
(256, 1, 9, 'y', '2023-03-23 13:45:25', 0),
(257, 1, 9, 'testy', '2023-03-23 13:47:00', 0);

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `ID` int(11) NOT NULL,
  `Unique_id` int(11) NOT NULL,
  `Username` mediumtext NOT NULL,
  `Email` mediumtext NOT NULL,
  `Password` mediumtext NOT NULL,
  `Image` mediumtext NOT NULL,
  `Security_Code` mediumtext NOT NULL,
  `Status` tinyint(1) NOT NULL,
  `Activation` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `ID` int(11) NOT NULL,
  `Username` mediumtext NOT NULL,
  `Email` mediumtext NOT NULL,
  `Password` mediumtext NOT NULL,
  `Image` mediumtext NOT NULL,
  `Security_Code` mediumtext NOT NULL,
  `Status` mediumtext NOT NULL,
  `Activation` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`ID`, `Username`, `Email`, `Password`, `Image`, `Security_Code`, `Status`, `Activation`) VALUES
(1, 'ArabPixel', '', '123321', '', '', 'Online', 1),
(2, 'Merve', '', 'Kuchen123', '', '', '', 1),
(3, 'Leander', '', 'Test1234', '', '', 'Offline', 1),
(4, '7Obeida', '', 'SasukeUchihaQDH20', '', '', '', 1),
(5, 'Mohammad', '', 'Mohammad', '', '', '', 1),
(6, 'tito', '', 'metalika', '', '', '', 1),
(7, 'TaylanPapi', '', 'Anus1234', '', '', '', 1),
(8, 'Yaloo', '', 'yaloo', '', '', 'Offline', 1),
(9, 'razani2009othman@gmail.com', '', 'razan2009', '', '', 'Offline', 1),
(10, 'razan2009', '', 'razan2009', '', '', 'Online', 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `friends`
--
ALTER TABLE `friends`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `groups`
--
ALTER TABLE `groups`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`ID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `friends`
--
ALTER TABLE `friends`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;

--
-- AUTO_INCREMENT for table `groups`
--
ALTER TABLE `groups`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `messages`
--
ALTER TABLE `messages`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=258;

--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
